grevaillot/svd_tools/headers/ATSAMV71Q21B/mcan1.h
/** MCAN1_MCAN_GFC_RRFS Reject Remote Frames Standard **/
#define MCAN1_MCAN_GFC_RRFS		(1 << 1)
/** MCAN1_MCAN_GFC_RRFE Reject Remote Frames Extended **/
#define MCAN1_MCAN_GFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_sidfc MCANSIDFC Standard ID Filter Configuration Register
@{*/


#define MCAN1_MCAN_SIDFC_LSS_SHIFT		16
#define MCAN1_MCAN_SIDFC_LSS_MASK		0xff
/** @defgroup mcan1_mcan_sidfc_lss LSS List Size Standard
@{*/
/**@}*/


#define MCAN1_MCAN_SIDFC_FLSSA_SHIFT		2
#define MCAN1_MCAN_SIDFC_FLSSA_MASK		0x3fff
/** @defgroup mcan1_mcan_sidfc_flssa FLSSA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_xidfc MCANXIDFC Extended ID Filter Configuration Register
@{*/


#define MCAN1_MCAN_XIDFC_LSE_SHIFT		16
#define MCAN1_MCAN_XIDFC_LSE_MASK		0x7f
/** @defgroup mcan1_mcan_xidfc_lse LSE List Size Extended
@{*/
/**@}*/


#define MCAN1_MCAN_XIDFC_FLESA_SHIFT		2
#define MCAN1_MCAN_XIDFC_FLESA_MASK		0x3fff
/** @defgroup mcan1_mcan_xidfc_flesa FLESA Filter List Extended Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_xidam MCANXIDAM Extended ID AND Mask Register
@{*/


#define MCAN1_MCAN_XIDAM_EIDM_SHIFT		0
#define MCAN1_MCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup mcan1_mcan_xidam_eidm EIDM Extended ID Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_hpms MCANHPMS High Priority Message Status Register
@{*/

/** MCAN1_MCAN_HPMS_FLST Filter List **/
#define MCAN1_MCAN_HPMS_FLST		(1 << 15)

#define MCAN1_MCAN_HPMS_FIDX_SHIFT		8
#define MCAN1_MCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup mcan1_mcan_hpms_fidx FIDX Filter Index
@{*/
/**@}*/


#define MCAN1_MCAN_HPMS_MSI_SHIFT		6
#define MCAN1_MCAN_HPMS_MSI_MASK		0x03
/** @defgroup mcan1_mcan_hpms_msi MSI Message Storage Indicator
@{*/
/**@}*/


#define MCAN1_MCAN_HPMS_BIDX_SHIFT		0
#define MCAN1_MCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup mcan1_mcan_hpms_bidx BIDX Buffer Index
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan1_mcan_ndat1 MCANNDAT1 New Data 1 Register
@{*/

/** MCAN1_MCAN_NDAT1_ND31 New Data **/
#define MCAN1_MCAN_NDAT1_ND31		(1 << 31)
/** MCAN1_MCAN_NDAT1_ND30 New Data **/
#define MCAN1_MCAN_NDAT1_ND30		(1 << 30)
/** MCAN1_MCAN_NDAT1_ND29 New Data **/
#define MCAN1_MCAN_NDAT1_ND29		(1 << 29)
/** MCAN1_MCAN_NDAT1_ND28 New Data **/
#define MCAN1_MCAN_NDAT1_ND28		(1 << 28)
/** MCAN1_MCAN_NDAT1_ND27 New Data **/
#define MCAN1_MCAN_NDAT1_ND27		(1 << 27)
/** MCAN1_MCAN_NDAT1_ND26 New Data **/
#define MCAN1_MCAN_NDAT1_ND26		(1 << 26)
/** MCAN1_MCAN_NDAT1_ND25 New Data **/
#define MCAN1_MCAN_NDAT1_ND25		(1 << 25)
/** MCAN1_MCAN_NDAT1_ND24 New Data **/
#define MCAN1_MCAN_NDAT1_ND24		(1 << 24)
/** MCAN1_MCAN_NDAT1_ND23 New Data **/
#define MCAN1_MCAN_NDAT1_ND23		(1 << 23)
/** MCAN1_MCAN_NDAT1_ND22 New Data **/
#define MCAN1_MCAN_NDAT1_ND22		(1 << 22)
/** MCAN1_MCAN_NDAT1_ND21 New Data **/
#define MCAN1_MCAN_NDAT1_ND21		(1 << 21)
/** MCAN1_MCAN_NDAT1_ND20 New Data **/
#define MCAN1_MCAN_NDAT1_ND20		(1 << 20)
/** MCAN1_MCAN_NDAT1_ND19 New Data **/
#define MCAN1_MCAN_NDAT1_ND19		(1 << 19)
/** MCAN1_MCAN_NDAT1_ND18 New Data **/
#define MCAN1_MCAN_NDAT1_ND18		(1 << 18)
/** MCAN1_MCAN_NDAT1_ND17 New Data **/
#define MCAN1_MCAN_NDAT1_ND17		(1 << 17)
/** MCAN1_MCAN_NDAT1_ND16 New Data **/
#define MCAN1_MCAN_NDAT1_ND16		(1 << 16)
/** MCAN1_MCAN_NDAT1_ND15 New Data **/
#define MCAN1_MCAN_NDAT1_ND15		(1 << 15)
/** MCAN1_MCAN_NDAT1_ND14 New Data **/
#define MCAN1_MCAN_NDAT1_ND14		(1 << 14)
/** MCAN1_MCAN_NDAT1_ND13 New Data **/
#define MCAN1_MCAN_NDAT1_ND13		(1 << 13)
/** MCAN1_MCAN_NDAT1_ND12 New Data **/
#define MCAN1_MCAN_NDAT1_ND12		(1 << 12)
/** MCAN1_MCAN_NDAT1_ND11 New Data **/
#define MCAN1_MCAN_NDAT1_ND11		(1 << 11)
/** MCAN1_MCAN_NDAT1_ND10 New Data **/
#define MCAN1_MCAN_NDAT1_ND10		(1 << 10)
/** MCAN1_MCAN_NDAT1_ND9 New Data **/
#define MCAN1_MCAN_NDAT1_ND9		(1 << 9)
/** MCAN1_MCAN_NDAT1_ND8 New Data **/
#define MCAN1_MCAN_NDAT1_ND8		(1 << 8)
/** MCAN1_MCAN_NDAT1_ND7 New Data **/
#define MCAN1_MCAN_NDAT1_ND7		(1 << 7)
/** MCAN1_MCAN_NDAT1_ND6 New Data **/
#define MCAN1_MCAN_NDAT1_ND6		(1 << 6)
/** MCAN1_MCAN_NDAT1_ND5 New Data **/
#define MCAN1_MCAN_NDAT1_ND5		(1 << 5)
/** MCAN1_MCAN_NDAT1_ND4 New Data **/
#define MCAN1_MCAN_NDAT1_ND4		(1 << 4)
/** MCAN1_MCAN_NDAT1_ND3 New Data **/
#define MCAN1_MCAN_NDAT1_ND3		(1 << 3)
/** MCAN1_MCAN_NDAT1_ND2 New Data **/
#define MCAN1_MCAN_NDAT1_ND2		(1 << 2)
/** MCAN1_MCAN_NDAT1_ND1 New Data **/
#define MCAN1_MCAN_NDAT1_ND1		(1 << 1)
/** MCAN1_MCAN_NDAT1_ND0 New Data **/
#define MCAN1_MCAN_NDAT1_ND0		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_ndat2 MCANNDAT2 New Data 2 Register
@{*/

/** MCAN1_MCAN_NDAT2_ND63 New Data **/
#define MCAN1_MCAN_NDAT2_ND63		(1 << 31)
/** MCAN1_MCAN_NDAT2_ND62 New Data **/
#define MCAN1_MCAN_NDAT2_ND62		(1 << 30)
/** MCAN1_MCAN_NDAT2_ND61 New Data **/
#define MCAN1_MCAN_NDAT2_ND61		(1 << 29)
/** MCAN1_MCAN_NDAT2_ND60 New Data **/
#define MCAN1_MCAN_NDAT2_ND60		(1 << 28)
/** MCAN1_MCAN_NDAT2_ND59 New Data **/
#define MCAN1_MCAN_NDAT2_ND59		(1 << 27)
/** MCAN1_MCAN_NDAT2_ND58 New Data **/
#define MCAN1_MCAN_NDAT2_ND58		(1 << 26)
/** MCAN1_MCAN_NDAT2_ND57 New Data **/
#define MCAN1_MCAN_NDAT2_ND57		(1 << 25)
/** MCAN1_MCAN_NDAT2_ND56 New Data **/
#define MCAN1_MCAN_NDAT2_ND56		(1 << 24)
/** MCAN1_MCAN_NDAT2_ND55 New Data **/
#define MCAN1_MCAN_NDAT2_ND55		(1 << 23)
/** MCAN1_MCAN_NDAT2_ND54 New Data **/
#define MCAN1_MCAN_NDAT2_ND54		(1 << 22)
/** MCAN1_MCAN_NDAT2_ND53 New Data **/
#define MCAN1_MCAN_NDAT2_ND53		(1 << 21)
/** MCAN1_MCAN_NDAT2_ND52 New Data **/
#define MCAN1_MCAN_NDAT2_ND52		(1 << 20)
/** MCAN1_MCAN_NDAT2_ND51 New Data **/
#define MCAN1_MCAN_NDAT2_ND51		(1 << 19)
/** MCAN1_MCAN_NDAT2_ND50 New Data **/
#define MCAN1_MCAN_NDAT2_ND50		(1 << 18)
/** MCAN1_MCAN_NDAT2_ND49 New Data **/
#define MCAN1_MCAN_NDAT2_ND49		(1 << 17)
/** MCAN1_MCAN_NDAT2_ND48 New Data **/
#define MCAN1_MCAN_NDAT2_ND48		(1 << 16)
/** MCAN1_MCAN_NDAT2_ND47 New Data **/
#define MCAN1_MCAN_NDAT2_ND47		(1 << 15)
/** MCAN1_MCAN_NDAT2_ND46 New Data **/
#define MCAN1_MCAN_NDAT2_ND46		(1 << 14)
/** MCAN1_MCAN_NDAT2_ND45 New Data **/
#define MCAN1_MCAN_NDAT2_ND45		(1 << 13)
/** MCAN1_MCAN_NDAT2_ND44 New Data **/
#define MCAN1_MCAN_NDAT2_ND44		(1 << 12)
/** MCAN1_MCAN_NDAT2_ND43 New Data **/
#define MCAN1_MCAN_NDAT2_ND43		(1 << 11)
/** MCAN1_MCAN_NDAT2_ND42 New Data **/
#define MCAN1_MCAN_NDAT2_ND42		(1 << 10)
/** MCAN1_MCAN_NDAT2_ND41 New Data **/
#define MCAN1_MCAN_NDAT2_ND41		(1 << 9)
/** MCAN1_MCAN_NDAT2_ND40 New Data **/
#define MCAN1_MCAN_NDAT2_ND40		(1 << 8)
/** MCAN1_MCAN_NDAT2_ND39 New Data **/
#define MCAN1_MCAN_NDAT2_ND39		(1 << 7)
/** MCAN1_MCAN_NDAT2_ND38 New Data **/
#define MCAN1_MCAN_NDAT2_ND38		(1 << 6)
/** MCAN1_MCAN_NDAT2_ND37 New Data **/
#define MCAN1_MCAN_NDAT2_ND37		(1 << 5)
/** MCAN1_MCAN_NDAT2_ND36 New Data **/
#define MCAN1_MCAN_NDAT2_ND36		(1 << 4)
/** MCAN1_MCAN_NDAT2_ND35 New Data **/
#define MCAN1_MCAN_NDAT2_ND35		(1 << 3)
/** MCAN1_MCAN_NDAT2_ND34 New Data **/
#define MCAN1_MCAN_NDAT2_ND34		(1 << 2)
/** MCAN1_MCAN_NDAT2_ND33 New Data **/
#define MCAN1_MCAN_NDAT2_ND33		(1 << 1)
/** MCAN1_MCAN_NDAT2_ND32 New Data **/
#define MCAN1_MCAN_NDAT2_ND32		(1 << 0)

/**@}*/

/** @defgroup mcan1_mcan_rxf0c MCANRXF0C Receive FIFO 0 Configuration Register
@{*/

/** MCAN1_MCAN_RXF0C_F0OM FIFO 0 Operation Mode **/
#define MCAN1_MCAN_RXF0C_F0OM		(1 << 31)

